cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'zsh'
brew 'ack'
brew 'git'
brew 'automake'
brew 'libgpg-error'
brew 'coreutils'
brew 'imagemagick'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'libksba'
brew 'libunistring'
brew 'openssh'
brew 'libyaml'
brew 'pkg-config'
brew 'autoconf'
brew 'icu4c'
brew 'libidn2'
brew 'libtool'

cask '1password'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'steam'
cask 'spotify'
cask 'virtualbox'
cask 'iterm2'
cask 'docker'
