cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'zsh'
brew 'ack'
brew 'git'
brew 'automake'
brew 'libgpg-error'
brew 'coreutils'
brew 'imagemagick'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'wget'
brew 'libksba'
brew 'libunistring'
brew 'openssh'
brew 'libyaml'
brew 'pkg-config'
brew 'autoconf'
brew 'icu4c'
brew 'libidn2'
brew 'libtool'
brew 'mas'
brew 'tree'
brew 'duti'
brew "cmatrix"

# .browser
# cask 'firefox'
# cask 'google-chrome'
# cask 'microsoft-edge'
cask 'zen'

# .spotlight
# cask 'alfred'
cask 'raycast'

# .commu
# cask 'slack'
# cask 'discord'
# cask 'whatsapp'

# .utility
cask 'stats'
cask 'appcleaner'
cask 'balenaetcher'
cask 'vlc'
cask 'mtmr'
cask 'hiddenbar'
cask 'megasync'
cask 'onionshare'
cask 'pritunl'
cask 'sonic-pi'
cask 'karabiner-elements'
mas "Magnet", id: 441258766
# cask 'tageditor'
mas "Tag Editor 2", id: 984278082

# .note
cask 'obsidian'
cask 'notion'

# .dev
cask 'iterm2'
cask 'docker'

# .editor
cask 'visual-studio-code'